tap "jesseduffield/lazygit"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "homebrew/cask-fonts"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-driven, interactive function plotting
brew "gnuplot"
# File format designed to store large amounts of data
brew "hdf5"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"

# Web browser
cask "google-chrome"
# Gecko based web browser
cask "zen"
# Markdown note-taking app
cask "obsidian"
# Time blocking and productivity platform
cask "akiflow"
# Music streaming service
cask "spotify"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Voice and text chat for communities
cask "discord"
# Flashcard app using spaced repetition
cask "anki"
# Password manager developed by Nord Security
cask "nordpass"
# Smooth scrolling utility for macOS mice and trackpads
cask "mos"
# Uninstall applications and associated files cleanly
cask "appcleaner"
# Data science software focusing on R and Python
cask "rstudio"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Full TeX Live distribution with GUI applications
cask "mactex"
# GPU-based terminal emulator
cask "kitty"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-sn-pro"
